ColZeo_3D/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0; // Lecho sin CO2 inicialmente

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.2171; // Convertido de 0.15 molar
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
    }
    wall
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}
