ColZeo_3D/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1; // Lecho saturado de N2 inicialmente

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.7829; // Convertido de 0.85 molar
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           $internalField;
    }
    wall
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}
