ColZeo_3D/0/Ts
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ts;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 299.15;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            fixedValue;
        value           uniform 299.15;
    }
}
