ColZeo_3D/constant/adsorptionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206 (o superior)                    |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      adsorptionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ------------------------------------------------------------------------- //
// 1. Propiedades del Lecho Poroso y Sólido
// ------------------------------------------------------------------------- //
epsil           [0 0 0 0 0 0 0] 0.4;             // Asumido, típico para lechos de adsorción
dp              [0 1 0 0 0 0 0] 0.00205;         // [m] Diámetro promedio de partícula
rhoSolid        [1 -3 0 0 0 0 0] 1120.0;         // [kg/m^3] Típico para Zeolita 13X

// ------------------------------------------------------------------------- //
// 2. Propiedades Térmicas
// ------------------------------------------------------------------------- //
kappaSolid      [1 1 -3 -1 0 0 0] 0.2;           // [W/m/K] Asumida isotrópica
CpSolid         [0 2 -2 -1 0 0 0] 1070.0;        // [J/kg/K] Derivado del análisis paramétrico

deltaH_CO2      [0 2 -2 0 0 0 0] 969552.0;       // [J/kg] Convertido desde 42.67 kJ/mol
deltaH_N2       [0 2 -2 0 0 0 0] 580150.0;       // [J/kg] Convertido desde 16.25 kJ/mol

// ------------------------------------------------------------------------- //
// 3. Propiedades Cinéticas y Transporte de Masa
// ------------------------------------------------------------------------- //
// NOTA: El paper calcula D_L y LDF_k dinámicamente vía UDF. 
// Valores proporcionados a continuación son representativos estáticos.
D_L             [0 2 -1 0 0 0 0] 1e-5;           // [m^2/s] Coeficiente de dispersión axial
LDF_CO2         [0 0 -1 0 0 0 0] 0.15;           // [1/s] Coef. Fuerza Impulsora Lineal CO2
LDF_N2          [0 0 -1 0 0 0 0] 0.05;           // [1/s] Coef. Fuerza Impulsora Lineal N2

MW_CO2          [1 0 0 0 -1 0 0] 0.04401;        // [kg/mol]
MW_N2           [1 0 0 0 -1 0 0] 0.02801;        // [kg/mol]

R [1 2 -2 -1 -1 0 0] 8.3144626; //

// ---- CO2 (Heavy Product) ----
qsb_CO2         [-1 0 0 0 1 0 0] 3.257;        // [mol/kg]
b0_CO2          [0 3 0 0 -1 0 0] 2.09e-7;      // [m^3/mol]
dU_b_CO2        [1 2 -2 0 -1 0 0] -42670.0;    // [J/mol] ¡Añadido!

qsd_CO2         [-1 0 0 0 1 0 0] 3.240;        // [mol/kg]
d0_CO2          [0 3 0 0 -1 0 0] 1.06e-7;      // [m^3/mol]
dU_d_CO2        [1 2 -2 0 -1 0 0] -32210.0;    // [J/mol] ¡Añadido!

// ---- N2 (Light Product) ----
qsb_N2          [-1 0 0 0 1 0 0] 3.257;        // [mol/kg]
b0_N2           [0 3 0 0 -1 0 0] 7.13e-6;      // [m^3/mol]
dU_b_N2         [1 2 -2 0 -1 0 0] -16250.0;    // [J/mol] ¡Añadido!

qsd_N2          [-1 0 0 0 1 0 0] 3.240;        // [mol/kg]
d0_N2           [0 3 0 0 -1 0 0] 2.13e-6;      // [m^3/mol]
dU_d_N2         [1 2 -2 0 -1 0 0] -16250.0;    // [J/mol] ¡Añadido!

// ************************************************************************* //
