ColZeo_3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       11830;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       11880;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       11930;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          6000;
        startFace       12050;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          6000;
        startFace       18050;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       24050;
    }
)

// ************************************************************************* //
